meeting/agenda/2026/02-17.org
:PROPERTIES:
:ID:       97701371-7793-4DCE-8F38-44887E434739
:END:
#+title: QT4 CG Meeting 153 Agenda 2026-02-17
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/02-10.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 17 February 2026.

The next meeting is planned for 24 February 2026.

** Review of open action items [1/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-143-03: JK to look for C14N test suites.
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-149-01: CG to draft a new PR with the common rule note.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [X] QT4CG-150-03: NW to setup an agenda item to review open issues
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-151-01: MK to fix the typo in the build-dateTime function.
+ [ ] QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT
+ [ ] QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2313][#2313]]: 2298 XQFO rules: definition of default values
+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2446][#2446]]: 2427 Add computed node constructors to XPath

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2234][#2234]]: Replace `a/get(XX)` with `a/?(XX)`

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2457][#2457]]: Improved use of fos:result
+ PR [[https://qt4cg.org/dashboard/#pr-2456][#2456]]: Stylesheet handling of fos:result/@narrative

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package

*** To be triaged
:PROPERTIES:
:CUSTOM_ID: triage
:END:

The following issues need to be triaged.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2465][#2465]]: Error description of FODC0006 should be more generic
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2464][#2464]]: add method to use path()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2463][#2463]]: Add map:apply() or third argument to fn:apply() as a map of names to parameter values.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2462][#2462]]: Revert dynamic function calls on sequences
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2461][#2461]]: Unparsed entities
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2460][#2460]]: file:read-text and invalid XML characters
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2459][#2459]]: What are "invalid XML characters" in the XPath file read functions?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2458][#2458]]: NodeTests: Unify jnode(X) and get(X)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2455][#2455]]: `file:copy`: creating targets
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2454][#2454]]: Grammar: literals & constants, negative numbers
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2448][#2448]]: Change title of XPath specification
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2433][#2433]]: `fn:jtree`: Identity
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2408][#2408]]: Editorial notes (incremental)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2390][#2390]]: methods and inheritance
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2389][#2389]]: Adaptive Serialization: more freedom?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2388][#2388]]: Adaptive Serialization: function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2381][#2381]]: Add facility to serialize binary values as url-safe base64 encoded strings
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2380][#2380]]: Use Case for Generators: News Feeds Aggregation Using Generators
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2338][#2338]]: Nomenclature: node(), gnode(), jnode(), xnode()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2321][#2321]]: Make `fn:trace` non-deterministic
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2314][#2314]]: `fn:error`: return type `xs:error` ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2300][#2300]]: `fn:doc`: determinism rules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2298][#2298]]: XQFO rules: definition of default values
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2284][#2284]]: fn:csv-doc, fn:json-doc: Equivalent code, unifications
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2275][#2275]]: Change record constructor, to simplify updates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2263][#2263]]: Named record types: TODOs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2257][#2257]]: Record declarations without namespace
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2252][#2252]]: Dynamic XPath Evaluation the functional way
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2245][#2245]]: Action QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2234][#2234]]: Replace `a/get(XX)` with `a/?(XX)`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2219][#2219]]: Generalize method calls to sequences
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2215][#2215]]: XQFO xref from xml-to-json() to element-to-map()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2198][#2198]]: Serialization parameter: `conditional-cdata`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2169][#2169]]: Longest-token rule incorrectly produces `StringInterpolation` delimiter
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2128][#2128]]: JNodes and XSLT Streaming
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2052][#2052]]: fn:collation-available: $usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2039][#2039]]: Generalize context item to context value in XSLT
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2018][#2018]]: Type-checking the result of xsl:apply-templates
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2000][#2000]]: element-to-map() - type signature of plan
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1979][#1979]]: Records: Type Safety
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1949][#1949]]: fn:element-to-map: Updated Feedback
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1948][#1948]]: fn:element-to-map: Tests
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1920][#1920]]: Parse functions: determinism
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1697][#1697]]: Add documentary names to callback function signatures
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1528][#1528]]: Computed node constructors: observations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1479][#1479]]: Default element namespace in XQuery: interaction of 'fixed' and '##any'
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1459][#1459]]: Function properties and arities
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1310][#1310]]: add fn:match-groups() function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/641][#641]]: Serialization fallback

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Improvements to FOS 
:PROPERTIES:
:CUSTOM_ID: h-F7DE29C3-E195-4196-9A09-81D2E5F578E1
:END:

See PR [[https://qt4cg.org/dashboard/#pr-2457][#2457]] Improved use of fos:result, and
PR [[https://qt4cg.org/dashboard/#pr-2456][#2456]]: Stylesheet handling of fos:result/@narrative

** Issue #2460: file:read-text and invalid XML characters
:PROPERTIES:
:CUSTOM_ID: h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7
:END:

See issue [[https://github.com/qt4cg/qtspecs/issues/2460][#2460]]: file:read-text and invalid XML characters

Perhaps we can decide what needs to be done here.

** Other issue triage
:PROPERTIES:
:CUSTOM_ID: h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7
:END:

Proposals for how to proceed most humbly solicited. In the absense of any such
proposal, I think a good first step would be to look over the 78 open issues and
divide them into “required for 4.0” and “nice to have” and perhaps even “close
with no further action.” Any we can’t decide on, we can just leave for another
day.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
