meeting/agenda/2026/02-17.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 153 Agenda 2026-02-17</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 153 Agenda 2026-02-17</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/02-10.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 17 February 2026.
</p>

<p>
The next meeting is planned for 24 February 2026.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-143-03: JK to look for C14N test suites.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-149-01: CG to draft a new PR with the common rule note.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="on"><code>[X]</code> QT4CG-150-03: NW to setup an agenda item to review open issues</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-01: MK to fix the typo in the build-dateTime function.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-151-03: NW to investigate why records are formatted incorrectly in XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-152-01: MK to add a note about the new and old syntax for names in PR #2446</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2313">#2313</a>: 2298 XQFO rules: definition of default values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2446">#2446</a>: 2427 Add computed node constructors to XPath</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2234">#2234</a>: Replace `a/get(XX)` with `a/?(XX)`</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2457">#2457</a>: Improved use of fos:result</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2456">#2456</a>: Stylesheet handling of fos:result/@narrative</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
<div id="outline-container-triage" class="outline-4">
<h4 id="triage"><span class="section-number-4">1.6.6.</span> To be triaged</h4>
<div class="outline-text-4" id="text-triage">
<p>
The following issues need to be triaged.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2465">#2465</a>: Error description of FODC0006 should be more generic</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2464">#2464</a>: add method to use path()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2463">#2463</a>: Add map:apply() or third argument to fn:apply() as a map of names to parameter values.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2462">#2462</a>: Revert dynamic function calls on sequences</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2461">#2461</a>: Unparsed entities</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2460">#2460</a>: <a href="read-text">read-text</a> and invalid XML characters</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2459">#2459</a>: What are "invalid XML characters" in the XPath file read functions?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2458">#2458</a>: NodeTests: Unify jnode(X) and get(X)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2455">#2455</a>: `<a href="copy">copy</a>`: creating targets</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2454">#2454</a>: Grammar: literals &amp; constants, negative numbers</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2448">#2448</a>: Change title of XPath specification</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2433">#2433</a>: `fn:jtree`: Identity</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2408">#2408</a>: Editorial notes (incremental)</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2390">#2390</a>: methods and inheritance</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2389">#2389</a>: Adaptive Serialization: more freedom?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2388">#2388</a>: Adaptive Serialization: function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2381">#2381</a>: Add facility to serialize binary values as url-safe base64 encoded strings</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2380">#2380</a>: Use Case for Generators: News Feeds Aggregation Using Generators</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2338">#2338</a>: Nomenclature: node(), gnode(), jnode(), xnode()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2321">#2321</a>: Make `fn:trace` non-deterministic</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2314">#2314</a>: `fn:error`: return type `xs:error` ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2300">#2300</a>: `fn:doc`: determinism rules</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2298">#2298</a>: XQFO rules: definition of default values</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2284">#2284</a>: fn:csv-doc, fn:json-doc: Equivalent code, unifications</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2275">#2275</a>: Change record constructor, to simplify updates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2263">#2263</a>: Named record types: TODOs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2257">#2257</a>: Record declarations without namespace</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2252">#2252</a>: Dynamic XPath Evaluation the functional way</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2245">#2245</a>: Action QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2234">#2234</a>: Replace `a/get(XX)` with `a/?(XX)`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2219">#2219</a>: Generalize method calls to sequences</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2215">#2215</a>: XQFO xref from xml-to-json() to element-to-map()</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2198">#2198</a>: Serialization parameter: `conditional-cdata`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2169">#2169</a>: Longest-token rule incorrectly produces `StringInterpolation` delimiter</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2128">#2128</a>: JNodes and XSLT Streaming</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2052">#2052</a>: fn:collation-available: $usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2039">#2039</a>: Generalize context item to context value in XSLT</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2018">#2018</a>: Type-checking the result of xsl:apply-templates</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2000">#2000</a>: element-to-map() - type signature of plan</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1979">#1979</a>: Records: Type Safety</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1949">#1949</a>: fn:element-to-map: Updated Feedback</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1948">#1948</a>: fn:element-to-map: Tests</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1920">#1920</a>: Parse functions: determinism</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1697">#1697</a>: Add documentary names to callback function signatures</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1528">#1528</a>: Computed node constructors: observations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1479">#1479</a>: Default element namespace in XQuery: interaction of 'fixed' and '##any'</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1459">#1459</a>: Function properties and arities</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1310">#1310</a>: add fn:match-groups() function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/641">#641</a>: Serialization fallback</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-h-F7DE29C3-E195-4196-9A09-81D2E5F578E1" class="outline-3">
<h3 id="h-F7DE29C3-E195-4196-9A09-81D2E5F578E1"><span class="section-number-3">2.1.</span> Improvements to FOS</h3>
<div class="outline-text-3" id="text-h-F7DE29C3-E195-4196-9A09-81D2E5F578E1">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2457">#2457</a> Improved use of fos:result, and
PR <a href="https://qt4cg.org/dashboard/#pr-2456">#2456</a>: Stylesheet handling of fos:result/@narrative
</p>
</div>
</div>
<div id="outline-container-h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7" class="outline-3">
<h3 id="h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7"><span class="section-number-3">2.2.</span> Issue #2460: <a href="read-text">read-text</a> and invalid XML characters</h3>
<div class="outline-text-3" id="text-h-D51FB09C-1C0E-4C5A-8D3E-15DF1BD60FA7">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/2460">#2460</a>: <a href="read-text">read-text</a> and invalid XML characters
</p>

<p>
Perhaps we can decide what needs to be done here.
</p>
</div>
</div>
<div id="outline-container-h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7" class="outline-3">
<h3 id="h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7"><span class="section-number-3">2.3.</span> Other issue triage</h3>
<div class="outline-text-3" id="text-h-CAC3A474-CC59-4E99-9508-DED1B7DC26C7">
<p>
Proposals for how to proceed most humbly solicited. In the absense of any such
proposal, I think a good first step would be to look over the 78 open issues and
divide them into “required for 4.0” and “nice to have” and perhaps even “close
with no further action.” Any we can’t decide on, we can just leave for another
day.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
